test/zoo/basic/ddl/basic_2_ddl.dbml
Table CLIENT {
  "Réf. client" VARCHAR(8) [pk, not null]
  Nom VARCHAR(255)
  "Prénom" VARCHAR(255)
  Adresse VARCHAR(255)
}

Table COMMANDE {
  "Num. commande" VARCHAR(8) [pk, not null]
  Date DATE
  Montant DECIMAL(10,2)
  "Réf. client" VARCHAR(8) [not null]
}

Table INCLURE {
  "Num. commande" VARCHAR(8) [not null]
  "Réf. produit" VARCHAR(8) [not null]
  "Quantité" INTEGER
  Indexes {
    ("Num. commande", "Réf. produit") [pk]
  }
}

Table PRODUIT {
  "Réf. produit" VARCHAR(8) [pk, not null]
  "Libellé" VARCHAR(50)
  "Prix unitaire" DECIMAL(10,2)
}

Ref:COMMANDE."Réf. client" > CLIENT."Réf. client"
Ref:INCLURE."Num. commande" > COMMANDE."Num. commande"
Ref:INCLURE."Réf. produit" > PRODUIT."Réf. produit"
